aT = [31 31 32 32 33 34 34 33 32 32 31 31;
     31 32 33 34 35 36 36 35 34 33 32 31;
     32 33 35 36 37 38 38 37 36 32 31 30;
     33 34 36 37 38 39 39 38 37 33 32 31;
     33 34 36 37 38 39 39 38 37 33 32 31;
     32 33 35 36 37 38 38 37 36 32 31 30;
     31 32 33 34 35 36 36 35 34 33 32 31;
     30 31 31 32 33 34 34 33 32 31 31 30];

% xの分割
x = 0:0.5:5.5;
% yの分割
y = 0:0.5:3.5;
% contour図の作成
figure
contourf(x,y,T,15,"LineColor","none");
colormap("turbo");
caxis([30 39]);
hcb = colorbar; 
ylabel(hcb, '地表面温度 [°C]');
xlabel('x [km]'); 
ylabel('y [km]');
title('都市ヒートアイランド：地表面温度（例データ）')

